# Adventure Works Cycles - Sales opportunities

<div class="alert alert-block alert-warning">
<b>About this project:</b> The goal of this project is to explore the Adventure Works database to identify opportunities for business enhancement through EDA (Exploratory Data Analysis).<br>
Adventure Works Cycles is a ficticious multinational manufacturing company, created by Microsoft for study purpose.<br>

<b>Findings:</b> Considering the adopted assumption, there are opportunities to 
</div>

## Project assumptions:
The ammount of sales opportunities will be represented by the sales quantity of each region and segment, when the result in (%) is below of the segment result (%) in total US sales.<br>
For the sake of study all the regions should perform the sales at the same mix as the total US sales.<br>

Granularity of data:<br>
Geographic: grouped by region | Date: group by month or year <br>

## Procedures
>1) Import libraries required <br>
>2) Import dataset (from local Microsoft SQL Server database).<br>
>3) Create the dataframes:<br>
    sales: result with region name, product segment, quantity, invoice value <br>
    population: US population quantity, grouped by region <br>
>4) Plot charts to explore data <br>
>5) Calculate the sales opportunities <br>
>6) Conclusion

### 1) Importing the libraries

In [1]:
import pyodbc
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import warnings
warnings.filterwarnings('ignore')

### 2) Connecting with SQL Server to get the data

In [2]:
connectiondata = (
    "Driver={SQL Server};"
    "Server=localhost\SQLEXPRESS;"
    "Database=AdventureWorks2019;"
    "Trusted_Connection=yes;")
## note to add when required; UID=login;PWD=senhadousuario)
connection = pyodbc.connect(connectiondata)
cursor = connection.cursor()

### 3) Creating the dataframes

In [3]:
# creating the sales dataframe 
query_sales = "SELECT convert(DATE,sh.OrderDate) as SalesDate, PP.Name as 'Product', CAST(sd.OrderQty AS INTEGER) as 'Qty', CAST(sd.LineTotal AS DECIMAL(20,2)) as 'InvoiceValue' FROM sales.SalesOrderDetail SD  INNER JOIN Sales.SalesOrderHeader SH ON SH.SalesOrderID = SD.SalesOrderID INNER JOIN Production.Product PP ON PP.ProductID = SD.ProductID"
cursor.execute(query_sales)
connection = pyodbc.connect(connectiondata)
cursor = connection.cursor()
pyodbc.setDecimalSeparator(',')
dfsales = pd.read_sql(query_sales,connection,parse_dates={'SalesDate': {'format': '%Y-%m-%d'}})
dfsales = pd.DataFrame(dfsales)
dfsales.dtypes

SalesDate       datetime64[ns]
Product                 object
Qty                      int64
InvoiceValue           float64
dtype: object

In [4]:
dfsales.info

<bound method DataFrame.info of         SalesDate                  Product  Qty  InvoiceValue
0      2011-05-31   Mountain-100 Black, 42    1      202499.0
1      2011-05-31   Mountain-100 Black, 44    3      607498.0
2      2011-05-31   Mountain-100 Black, 48    1      202499.0
3      2011-05-31  Mountain-100 Silver, 38    1      203999.0
4      2011-05-31  Mountain-100 Silver, 42    1      203999.0
...           ...                      ...  ...           ...
121312 2014-06-30    Fender Set - Mountain    1        2198.0
121313 2014-06-30             AWC Logo Cap    1         899.0
121314 2014-06-30    Fender Set - Mountain    1        2198.0
121315 2014-06-30   All-Purpose Bike Stand    1       15900.0
121316 2014-06-30             AWC Logo Cap    1         899.0

[121317 rows x 4 columns]>

In [5]:
dfsales.tail(3)

        SalesDate                 Product  Qty  InvoiceValue
121314 2014-06-30   Fender Set - Mountain    1        2198.0
121315 2014-06-30  All-Purpose Bike Stand    1       15900.0
121316 2014-06-30            AWC Logo Cap    1         899.0

In [6]:
# loading the US population dataframe 
censusall = pd.read_excel('Census_US_2010_2019.xlsx', skiprows = 3,nrows=5,usecols=(0,4,5,6,7))
#censusall['avg'] = censusall[2011]
col = censusall.loc[:,2011:2014]
censusall['population_median'] = col.median(axis=1)
censusall['population_median'] = censusall['population_median'].astype(int)
censusall.head(10)

,Unnamed: 0,2011,2012,2013,2014,population_median
0,United States,311556874,313830990,315993715,318301008,314912352
1,Northeast,55604223,55775216,55901806,56006011,55838511
2,Midwest,67157800,67336743,67560379,67745167,67448561
3,South,116006522,117241208,118364400,119624037,117802804
4,West,72788329,73477823,74167130,74925793,73822476